/********Переделать этот код так, чтобы в нем были операторы инкремента и декремента:************/
/*
   let num = 10;
   num = num + 1;
   num = num + 1;
   num = num - 1;
   console.log(num);*/

let num = 10;
num++;
num++;
num--;
console.log(num);

/****** Переделайте этот код так, чтобы в нем использовались операторы присвоения:*********/
/*
let num = 47;
num = num + 7;
num = num - 18;
num = num * 10;
num = num / 15;
alert(num);*/

let num1 = 47;
num1 += 7;
num1 -= 18;
num1 *= 10;
num1 /= 15;
alert(num1);

/***********Переделайте приведенный код так, чтобы в нем использовались операции
    +=, -=, *=, /=, ++, --.
Количество строк кода при этом не должно измениться.
    Код для переделки:***************/
/*let num = 1;
num = num + 12;
num = num - 14;
num = num * 5;
num = num / 7;
num = num + 1;
num = num - 1;
alert(num);*/

let num2 = 1;
num2 += 12;
num2 -= 14;
num2 *= 5;
num2 /= 7;
num2++;
num2--;
alert(num2);
