
/*Создайте переменные str1='САЛАМ, ' и str2='БИШКЕК!'.
   С помощью этих переменных выведите на экран фразу
   'САЛАМ, БИШКЕК!'*/

let str1 = 'Салам,'
let str2 = 'Бишкек'
alert(`${str1} ${str2}`);

/*
Создайте переменную name и присвойте ей ваше имя.
Выведите на экран строку'Привет, %Имя%!'.
Где %Имя должна вызываться созданная переменная.
*/

let str3 = 'Привет,';
let name3 = 'Aida!';
alert(`${str3} ${name3}`);

/* Создайте переменную age и присвойте ей ваш возраст.
    Выведите на экран 'Мне %Возраст% лет!'.
    Где %Возраст должна вызываться созданная переменная.*/

let str4 = 'Мне'
let age = 37;
let str5 = 'лет!'
alert(`${str4} ${age} ${str5}`);

